Modules/Admin/Http/Controllers/AdminArticleController.php

   public  function index(Request $request)
   {
       $articles = Article::whereRaw(1);
       if ($request->name) $articles->where('a_name','like','%'.$request->name.'%');
       $articles = $articles->paginate(10);
---
select * from `articles` where 1 and `a_name` like '%so sánh%' limit 10 offset 0
select count(*) as aggregate from `articles` where 1 and `a_name` like '%so sánh%'

    public function action($action,$id)
    {
        if ($action)
        {
            $article = Article::find($id);
            switch ($action)
            {
                case 'delete';
                    $article->delete();
                    break;

                case 'active';
                    $article->a_active = $article->a_active ? 0 : 1;
                    $article->save();
---
update `articles` set `a_active` = 0, `articles`.`updated_at` = '2020-08-01 18:21:36' where `id` = 2