Modules/Admin/Http/Controllers/AdminProductController.php

    public function index(Request $request)
    {
        $products = Product::with('category:id,c_name');

        if ($request->name) $products -> where('pro_name','like','%'.$request->name.'%');
        if ($request->cate) $products->where('pro_category_id',$request->cate);
---
select `id`, `c_name` from `categories` where `categories`.`id` in (1, 2)

    public function getCategories()
    {
        return Category::all();
---
select * from `categories`