Modules/Admin/Http/Controllers/AdminCategoryController.php

select `id`, `c_name`, `c_title_seo`, `c_active` from `categories`
---
    public function index()
    {
        $categories = Category::select('id','c_name','c_title_seo','c_active')->get();